In [23]:
import pandas as pd
df = pd.read_csv('./titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [24]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns',inplace=True)

In [25]:
target = df.Survived
inputs = df.drop('Survived', axis='columns')

In [26]:
dummies = pd.get_dummies(inputs.Sex)
dummies

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [27]:
inputs = pd.concat([inputs, dummies], axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [28]:
inputs.drop('Sex', axis='columns', inplace=True)
inputs

     Pclass   Age     Fare  female  male
0         3  22.0   7.2500       0     1
1         1  38.0  71.2833       1     0
2         3  26.0   7.9250       1     0
3         1  35.0  53.1000       1     0
4         3  35.0   8.0500       0     1
..      ...   ...      ...     ...   ...
886       2  27.0  13.0000       0     1
887       1  19.0  30.0000       1     0
888       3   NaN  23.4500       1     0
889       1  26.0  30.0000       0     1
890       3  32.0   7.7500       0     1

[891 rows x 5 columns]

In [29]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [30]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [31]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [32]:
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [33]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(inputs,target, test_size=0.2)

In [34]:
len(x_train)

712

In [35]:
len(x_test)

179

In [36]:
len(inputs)

891

In [37]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [38]:
model.fit(x_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [39]:
model.score(x_test,y_test)

0.7877094972067039

In [40]:
x_test[:10]

     Pclass        Age      Fare  female  male
597       3  49.000000    0.0000       0     1
466       2  29.699118    0.0000       0     1
322       2  30.000000   12.3500       1     0
222       3  51.000000    8.0500       0     1
825       3  29.699118    6.9500       0     1
527       1  29.699118  221.7792       0     1
748       1  19.000000   53.1000       0     1
790       3  29.699118    7.7500       0     1
430       1  28.000000   26.5500       0     1
103       3  33.000000    8.6542       0     1

In [41]:
y_test[:10]

597    0
466    0
322    1
222    0
825    0
527    0
748    0
790    0
430    1
103    0
Name: Survived, dtype: int64

In [42]:
model.predict(x_test[:10])

array([0, 0, 1, 0, 0, 1, 0, 0, 0, 0], dtype=int64)

In [44]:
model.predict_proba(x_test[:10])

array([[9.89835025e-01, 1.01649749e-02],
       [9.76969213e-01, 2.30307868e-02],
       [3.87402157e-02, 9.61259784e-01],
       [9.90346733e-01, 9.65326728e-03],
       [9.90245271e-01, 9.75472901e-03],
       [2.27982749e-07, 9.99999772e-01],
       [8.33060970e-01, 1.66939030e-01],
       [9.90291899e-01, 9.70810101e-03],
       [9.09579421e-01, 9.04205791e-02],
       [9.90619467e-01, 9.38053296e-03]])